/*
//////////////////////////////////////////////////

let userAnswer = prompt("Сколько тебе лет?", "");

if (userAnswer <= 18) {
  alert("Ты совсем юный!");
} else if (userAnswer > 18 && userAnswer <= 35) {
  alert("Ты молодой");
} else if (userAnswer > 35 && userAnswer <= 50) {
  alert("Ты совсем повзрослел!");
} else {
  alert("Похоже ты уже старик!");
}

//////////////////////////////////////////////////
*/

/*
//////////////////////////////////////////////////

let company = prompt("Кто придумал JS", "");

company == "Netscape" ? alert("Yes") : alert("No");

if (company == "Netscape") {
  alert("Yes");
} else {
  alert("no");
}

//////////////////////////////////////////////////
*/

/*
//////////////////////////////////////////////////

&& - AND

|| - OR

! - НЕ

//////////////////////////////////////////////////
*/
